code-review/NRB_3471_3546/База_Стало/InformationRegisters/ВнешниеИсточники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВнешниеИсточники</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОбменаДанными</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСертификатКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайлаСертификатаКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеСертификатаКлиента</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПарольСертификатаКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверятьСертификатСервера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонПодключенияКБДSQL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВнешнийИсточник</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВнешниеИсточники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КластерСерверов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/ChartsOfCharacteristicTypes/ВнешниеИсточники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ВнешниеИсточники</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.НастройкиОбменаДанными</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:StringQualifiers>
					<v8:Length>250</v8:Length>
				</v8:StringQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнегоИсточника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихИсточников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/CommonModules/ВебСервисыПовтИсп/Ext/Module.bsl
Функция ПолучитьПроксиСЭД() Экспорт
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.ВебСервисДокументооборот;
	ИмяСервиса = "DocStoreService";
	Возврат ПолучитьПроксиПоВнешнемуИсточнику(ВнешнийИсточник, ИмяСервиса);
КонецФункции

Функция ПолучитьПроксиСУДК() Экспорт
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.ВебСервисКлиенты;
	ИмяСервиса = "PersonalDataService";
	Возврат ПолучитьПроксиПоВнешнемуИсточнику(ВнешнийИсточник, ИмяСервиса);
КонецФункции

Функция ПолучитьПроксиИнтернетСервис() Экспорт
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.ВебСервисИнтернетСервис;
	ИмяСервиса = "InternetService";
	Возврат ПолучитьПроксиПоВнешнемуИсточнику(ВнешнийИсточник, ИмяСервиса);
КонецФункции

Функция РазложитьURLНаСоставляющие(URL) Экспорт
	Если Найти(URL, "about:blank") > 0 Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	Составляющие = Новый Структура;
	
	Позиция				= Найти(URL, "://");        
	Протокол			= Лев(URL, Позиция - 1);
	НачалоСервера		= Позиция + 3;
	СтрокаСерверПорт	= Сред(URL, НачалоСервера);
	ПозицияПорт			= Найти(СтрокаСерверПорт, ":");
	Если ПозицияПорт = 0 Тогда
		ПозицияКонцаСервера	= Найти(СтрокаСерверПорт, "/");
		СтрокаСервер		= Лев(СтрокаСерверПорт, ПозицияКонцаСервера - 1);
		СтрокаРесурс		= Сред(СтрокаСерверПорт, ПозицияКонцаСервера);
	Иначе
		СтрокаСервер		= Лев(СтрокаСерверПорт, ПозицияПорт - 1);
		СтрокаПортРесурс	= Сред(СтрокаСерверПорт, ПозицияПорт + 1);
		ПозицияРесурс		= Найти(СтрокаПортРесурс, "/");
		СтрокаПорт			= Лев(СтрокаПортРесурс, ПозицияРесурс - 1);
		СтрокаРесурс		= Сред(СтрокаПортРесурс, ПозицияРесурс);
		//---
		Составляющие.Вставить("Порт"	, Число(СтрокаПорт));
	КонецЕсли;
	
	Составляющие.Вставить("Сервер"	, СтрокаСервер);
	Составляющие.Вставить("Протокол", Протокол);
	Составляющие.Вставить("Ресурс"	, СтрокаРесурс);
	
	Возврат Составляющие;
КонецФункции

Функция ПолучитьПроксиПоВнешнемуИсточнику(ВнешнийИсточник, ИмяСервиса, НастройкиСоединения = Неопределено) Экспорт
	ПараметрыВнешнегоИсточника = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник);
	Адрес			= ПараметрыВнешнегоИсточника.Папка;
	ПространствоИмен= ПараметрыВнешнегоИсточника.База;
	ПараметрыАутентификации = Неопределено;
	Если ЗначениеЗаполнено(ПараметрыВнешнегоИсточника.Настройка)
		И ТипЗнч(ПараметрыВнешнегоИсточника.Настройка) = Тип("СправочникСсылка.НастройкиОбменаДанными") Тогда
		ДополнитьПараметрыИзНастройки(ПараметрыВнешнегоИсточника.Настройка, Адрес, ПространствоИмен, ПараметрыАутентификации);
	КонецЕсли; 
	
	ДопПараметрыЗапроса = Новый Структура();
	ДопПараметрыЗапроса.Вставить("Аутентификация", ПараметрыАутентификации);
	ЭтоЗащищенноеСоединение = СтрНачинаетсяС(НРег(Адрес), "https://");
	ЗащищенноеСоединение = Неопределено;
	Если ЭтоЗащищенноеСоединение Тогда
		НастройкиSSL = НастройкиSSLВнешнегоИсточника(ПараметрыВнешнегоИсточника.КлючПараметров);
		КлиентскийСертификат = СертификатКлиентаSSLИзПараметров(НастройкиSSL);
		ДопПараметрыЗапроса.Вставить("КлиентскийСертификатSSL", КлиентскийСертификат);
		ДопПараметрыЗапроса.Вставить("ПроверятьSSL", НастройкиSSL.ПроверятьСертификатСервера);
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(КлиентскийСертификат);
	КонецЕсли;
	
	ПроксиСервер = Неопределено;
	Сессия = КоннекторHTTP.СоздатьСессию();
	Таймаут = 0;
	Если НастройкиСоединения <> Неопределено Тогда
		Если НастройкиСоединения.Свойство("ПроксиСерверИспользовать") И НастройкиСоединения.ПроксиСерверИспользовать Тогда
			ПроксиСервер = Новый ИнтернетПрокси;
			ПроксиСервер.Установить("https", НастройкиСоединения.ПроксиСерверАдрес, НастройкиСоединения.ПроксиСерверПорт);
			ДопПараметрыЗапроса.Вставить("Прокси", ПроксиСервер);
		КонецЕсли;
		Если НастройкиСоединения.Свойство("КодироватьОтвет") И Не НастройкиСоединения.КодироватьОтвет Тогда
			Сессия.Заголовки.Вставить("Accept-Encoding", "identity");
		КонецЕсли;
		Если НастройкиСоединения.Свойство("Таймаут") Тогда
			Таймаут = НастройкиСоединения.Таймаут;
		КонецЕсли;
	КонецЕсли;
	
	ОтветWSDL = КоннекторHTTP.Get(Адрес, , ДопПараметрыЗапроса, Сессия);
	Если ОтветWSDL.КодСостояния <> 200 Тогда
		ОписаниеОшибки = СтрШаблон("Ошибка получения WSDL сервиса %1: код состояния %2, ответ сервера:
			|%3", 
			Адрес, 
			ОтветWSDL.КодСостояния, 
			ПолучитьСтрокуИзДвоичныхДанных(ОтветWSDL.Тело, ОтветWSDL.Кодировка));
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	
	ИмяФайлаWSDL = ПолучитьИмяВременногоФайла("WSDL");
	ДвоичныеДанныеОтвета = ОтветWSDL.Тело;
	ДвоичныеДанныеОтвета.Записать(ИмяФайлаWSDL);
	
	Определения = Новый WSОпределения(ИмяФайлаWSDL,
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыАутентификации, "Пользователь"),
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыАутентификации, "Пароль"), ПроксиСервер, Таймаут);
	
	Прокси = Новый WSПрокси(Определения, ПространствоИмен, ИмяСервиса, ИмяСервиса + "Soap", , , 
		?(ЭтоЗащищенноеСоединение, ЗащищенноеСоединение, Неопределено));
		
	Если ПараметрыАутентификации <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Прокси, ПараметрыАутентификации, "Пользователь, Пароль");
	КонецЕсли;
	
	УдалитьФайлы(ИмяФайлаWSDL);
		
	Возврат Прокси;
КонецФункции

Функция НастройкиSSLВнешнегоИсточника(КлючПараметровВнешнегоИсточника)
	
	НастройкиSSL = Новый Структура;
	НастройкиSSL.Вставить("ИмяФайлаСертификатаКлиента", "");
	НастройкиSSL.Вставить("ДанныеСертификатаКлиента", Неопределено);
	НастройкиSSL.Вставить("ПарольСертификатаКлиента", "");
	НастройкиSSL.Вставить("ПроверятьСертификатСервера", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнешниеИсточники.ИспользоватьСертификатКлиента КАК ИспользоватьСертификатКлиента,
	|	ВнешниеИсточники.ИмяФайлаСертификатаКлиента КАК ИмяФайлаСертификатаКлиента,
	|	ВнешниеИсточники.ДанныеСертификатаКлиента КАК ДанныеСертификатаКлиента,
	|	ВнешниеИсточники.ПарольСертификатаКлиента КАК ПарольСертификатаКлиента,
	|	ВнешниеИсточники.ПроверятьСертификатСервера КАК ПроверятьСертификатСервера
	|ИЗ
	|	РегистрСведений.ВнешниеИсточники КАК ВнешниеИсточники
	|ГДЕ
	|	ВнешниеИсточники.ВнешнийИсточник = &ВнешнийИсточник
	|	И ВнешниеИсточники.КластерСерверов = &КластерСерверов
	|	И ВнешниеИсточники.ИнформационнаяБаза = &ИнформационнаяБаза";
	Запрос.УстановитьПараметр("ВнешнийИсточник", КлючПараметровВнешнегоИсточника.ВнешнийИсточник);
	Запрос.УстановитьПараметр("КластерСерверов", КлючПараметровВнешнегоИсточника.КластерСерверов);
	Запрос.УстановитьПараметр("ИнформационнаяБаза", КлючПараметровВнешнегоИсточника.ИнформационнаяБаза);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		НастройкиSSL.ПроверятьСертификатСервера = Выборка.ПроверятьСертификатСервера;
		Если Выборка.ИспользоватьСертификатКлиента Тогда
			ЗаполнитьЗначенияСвойств(НастройкиSSL, Выборка, "ИмяФайлаСертификатаКлиента, ПарольСертификатаКлиента");
			НастройкиSSL.ДанныеСертификатаКлиента = Выборка.ДанныеСертификатаКлиента.Получить();
		КонецЕсли;
	КонецЕсли;
	
	Возврат НастройкиSSL;
	
КонецФункции

Процедура ДополнитьПараметрыИзНастройки(НастройкаОбмена, Адрес, ПространствоИмен, ПараметрыАутентификации)
	
	ДанныеНастройкиОбмена = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаОбмена,
		"СпособОбмена, ВебСервисАдрес, ВебСервисПространствоИмен, ВебСервисПользователь, ВебСервисПароль");
	Если ДанныеНастройкиОбмена.СпособОбмена = Перечисления.СпособыОбменаДанными.ОбменЧерезВебСервис Тогда
		Если Не ЗначениеЗаполнено(Адрес) Тогда
			Адрес = ДанныеНастройкиОбмена.ВебСервисАдрес;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ПространствоИмен) Тогда
			ПространствоИмен = ДанныеНастройкиОбмена.ВебСервисПространствоИмен;
		КонецЕсли;
		ПараметрыАутентификации = Новый Структура("Пользователь, Пароль", 
			ДанныеНастройкиОбмена.ВебСервисПользователь, ДанныеНастройкиОбмена.ВебСервисПароль);
	КонецЕсли;
		
КонецПроцедуры

Функция СертификатКлиентаSSLИзПараметров(ПараметрыВнешнегоИсточника);
	
	Если Не ПараметрыВнешнегоИсточника.Свойство("ИмяФайлаСертификатаКлиента") 
		Или Не ЗначениеЗаполнено(ПараметрыВнешнегоИсточника.ИмяФайлаСертификатаКлиента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ПараметрыВнешнегоИсточника.Свойство("ДанныеСертификатаКлиента") 
		Или Не ЗначениеЗаполнено(ПараметрыВнешнегоИсточника.ДанныеСертификатаКлиента)
		Или ТипЗнч(ПараметрыВнешнегоИсточника.ДанныеСертификатаКлиента) <> Тип("ДвоичныеДанные") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяФайлаСертификата = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогВременныхФайлов())
		+ "OpenSSLClientSertificates\" + ПараметрыВнешнегоИсточника.ИмяФайлаСертификатаКлиента;
	ЗаписатьФайлЕслиОтсутстуетИлиОтличается(ИмяФайлаСертификата, ПараметрыВнешнегоИсточника.ДанныеСертификатаКлиента); 
	
	ПарольСертификата = ?(ЗначениеЗаполнено(ПараметрыВнешнегоИсточника.ПарольСертификатаКлиента), 
		ПараметрыВнешнегоИсточника.ПарольСертификатаКлиента, 
		Неопределено);
	Возврат Новый СертификатКлиентаФайл(ИмяФайлаСертификата, ПарольСертификата);
	
КонецФункции

Процедура ЗаписатьФайлЕслиОтсутстуетИлиОтличается(ИмяФайла, ДанныеФайла)
	
	ФайлСертификата = Новый Файл(ИмяФайла);
	
	ТребуетсяЗаписать = Ложь;
	Если Не ФайлСертификата.Существует() Тогда
		ТребуетсяЗаписать = Истина;
	Иначе
		// Сравним хеши существующего и исходного файлов, при отличии перезапишем
		Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
		Хеширование.ДобавитьФайл(ИмяФайла);
		ХешСуществующегоФайла = Строка(Хеширование.ХешСумма);
		
		Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
		Хеширование.Добавить(ДанныеФайла);
		ХешНовогоФайла = Строка(Хеширование.ХешСумма);
		
		ТребуетсяЗаписать = ХешСуществующегоФайла <> ХешНовогоФайла;
	КонецЕсли;
	
	Если ТребуетсяЗаписать Тогда
		ДанныеФайла.Записать(ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры
